In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime

In [2]:
df = pd.read_excel('test-data.xlsx')

In [3]:
df.shape

(59998, 4)

59998 записей и четыре параметра

In [4]:
df.head()

   order_id             created  user_id  payment
0   3178039 2018-03-09 19:12:13     1066     1090
1   2940729 2018-02-02 13:56:01     4821      349
2   4260454 2018-08-14 13:32:25     4831      673
3   3468644 2018-04-24 14:24:58     9563      893
4   2842424 2018-01-15 15:44:33    12189      480

таблица заказов определяется номером заказа, временем, id пользователя и суммой

In [5]:
#отсортируем данные по времени
df_sorted = df.sort_values(by='created')

In [8]:
df_sorted.created.min(), df_sorted.created.max()

(Timestamp('2018-01-01 13:42:39'), Timestamp('2018-10-15 16:45:59'))

У нас данные с первого января 2018 по 15 октября 2018

In [9]:
#найдем номер недели для каждой транзакции
df_sorted['weekofyear'] = df_sorted.created.apply(lambda x: x.isocalendar()[1])

In [13]:
#найдем неделю первой покупки для каждого пользователя
first_user_week = pd.DataFrame(df_sorted.groupby(by='user_id')['weekofyear'].min()).reset_index()
first_user_week.columns =['user_id','first-user-week']

In [14]:
first_user_week.head()

   user_id  first-user-week
0     1066               10
1     4821                5
2     4831               33
3     9563               17
4    12189                3

In [15]:
#заджойним на исходную таблицу
new_df = df_sorted.merge(first_user_week, how='inner', on='user_id')

In [16]:
new_df.head()

   order_id             created  user_id  payment  weekofyear  first-user-week
0   2806102 2018-01-01 13:42:39   235067      340           1                1
1   4116816 2018-07-26 16:13:32   235067      282          30                1
2   2806119 2018-01-01 14:21:01   749173      680           1                1
3   3080702 2018-02-23 10:48:24   749173      680           8                1
4   3084503 2018-02-24 20:23:15   749173      680           8                1

In [17]:
#посчитаем третью неделю для каждого пользователя
new_df['3 weeks after'] = new_df['first-user-week'] + 2

In [29]:
new_df.head()

,order_id,created,user_id,payment,weekofyear,first-user-week,3 weeks after
0,2806102,2018-01-01 13:42:39,235067,340,1,1,3
1,4116816,2018-07-26 16:13:32,235067,282,30,1,3
2,2806119,2018-01-01 14:21:01,749173,680,1,1,3
3,3080702,2018-02-23 10:48:24,749173,680,8,1,3
4,3084503,2018-02-24 20:23:15,749173,680,8,1,3

In [27]:
#посчитаем сумму по третьим неделям
new_df[new_df['3 weeks after'] == new_df['weekofyear']].groupby(
    by='3 weeks after')['payment'].sum().sort_values(ascending=False).head()

3 weeks after
35    70802
33    64855
23    64383
37    58060
28    56648
Name: payment, dtype: int64

Мы получили, что на 35 й неделе сумма максимальная, значит клиенты, которые 
пришли на 33 й неделе принесли больше всего денег на третей неделе

In [28]:
new_df[new_df['3 weeks after'] == 35]

,order_id,created,user_id,payment,weekofyear,first-user-week,3 weeks after
52939,4245595,2018-08-13 09:09:59,1134156,224,33,33,35
52940,4245672,2018-08-13 09:18:58,1134172,614,33,33,35
52941,4245700,2018-08-13 09:22:33,1133425,322,33,33,35
52942,4245811,2018-08-13 09:35:01,1129601,744,33,33,35
52943,4245858,2018-08-13 09:39:30,1134198,408,33,33,35
52944,4430268,2018-09-03 09:23:26,1134198,370,36,33,35
52945,4245876,2018-08-13 09:41:39,1134201,411,33,33,35
52946,4245951,2018-08-13 09:49:09,1134214,300,33,33,35
52947,4246006,2018-08-13 09:54:57,1134218,351,33,33,35
52948,4246076,2018-08-13 10:02:10,1134236,407,33,33,35
52949,4246393,2018-08-13 10:22:21,1134281,566,33,33,35
52950,4283445,2018-08-16 15:17:47,1134281,285,33,33,35
52951,4247013,2018-08-13 10:59:43,1134362,636,33,33,35
52952,4247744,2018-08-13 11:36:54,1134477,452,33,33,35
52953,4256602,2018-08-14 09:59:01,1134477,416,33,33,35
52954,4257894,2018-08-14 11:15:27,1134477,388,33,33,35
52955,4259412,2018-08-14 12:33:24,1134477,347,33,33,35
52956,4260670,2018-08-14 13:45:57,1134477,453,33,33,35
52957,4262605,2018-08-14 15:59:04,1134477,352,33,33,35
52958,4262644,2018-08-14 16:03:04,1134477,373,33,33,35
52959,4263255,2018-08-14 16:58:29,1134477,310,33,33,35
52960,4264941,2018-08-14 19:35:18,1134477,374,33,33,35
52961,4302068,2018-08-19 09:45:53,1134477,313,33,33,35
52962,4341248,2018-08-23 13:14:00,1134477,338,34,33,35
52963,4342902,2018-08-23 14:45:49,1134477,965,34,33,35
52964,4346610,2018-08-23 19:55:10,1134477,333,34,33,35
52965,4365149,2018-08-27 09:50:53,1134477,320,35,33,35
52966,4365302,2018-08-27 10:02:11,1134477,362,35,33,35
52967,4366003,2018-08-27 10:42:54,1134477,265,35,33,35
52968,4366074,2018-08-27 10:47:16,1134477,571,35,33,35
...,...,...,...,...,...,...,...
54006,4693849,2018-09-29 18:36:56,1143642,524,39,33,35
54007,4762585,2018-10-06 12:51:32,1143642,646,40,33,35
54008,4300999,2018-08-18 15:35:31,1143646,343,33,33,35
54009,4301144,2018-08-18 16:16:53,1143691,222,33,33,35
54010,4301179,2018-08-18 16:26:55,1143704,2050,33,33,35
54011,4301400,2018-08-18 17:47:11,1143788,401,33,33,35
54012,4301525,2018-08-18 19:01:30,1143835,100,33,33,35
54013,4303358,2018-08-19 16:56:13,1143835,561,33,33,35
54014,4301688,2018-08-18 20:47:16,662644,452,33,33,35
54015,4316876,2018-08-21 10:51:32,662644,425,34,33,35
54016,4301706,2018-08-18 21:08:04,1143895,553,33,33,35
54017,4301848,2018-08-19 00:50:56,1144016,407,33,33,35
54018,4302021,2018-08-19 09:13:39,1144132,733,33,33,35
54019,4302327,2018-08-19 11:38:12,972383,364,33,33,35
54020,4302789,2018-08-19 13:59:40,1144411,732,33,33,35
54021,4441234,2018-09-04 08:02:55,1144411,963,36,33,35
54022,4302957,2018-08-19 14:52:58,1144472,344,33,33,35
54023,4355390,2018-08-24 15:41:39,1144472,321,34,33,35
54024,4303298,2018-08-19 16:37:36,1144594,468,33,33,35
54025,4303339,2018-08-19 16:49:56,1144606,305,33,33,35
54026,4303367,2018-08-19 17:00:16,1144621,567,33,33,35
54027,4303395,2018-08-19 17:15:14,1144636,293,33,33,35
54028,4303956,2018-08-19 21:31:46,1144636,266,33,33,35
54029,4303407,2018-08-19 17:16:56,815456,409,33,33,35
54030,4303516,2018-08-19 18:02:35,1144678,736,33,33,35
54031,4303527,2018-08-19 18:11:46,1144685,465,33,33,35
54032,4303765,2018-08-19 19:54:17,1144747,1870,33,33,35
54033,4304068,2018-08-19 22:29:30,1144890,371,33,33,35
54034,4304129,2018-08-19 23:15:30,1144921,2550,33,33,35
54035,4304133,2018-08-19 23:18:15,1144924,523,33,33,35